title: 'Dragnet [Container]: dragnet-container-2024-0989 — Vulnerable Base Image Pull'
id: ac9b9868-cced-59f2-bcdb-b4e5f2665792
status: deprecated
description: |
  Detects deployment of a container image known to contain a critical vulnerability.
  Incident: dragnet-container-2024-0989 (Tier 2, CVSS 10)
  Heap-based buffer overflow in sqbaselib.cpp in SQUIRREL 3.2 due to lack of a certain sq_reservestack call.
  First observed: 2024-11-21.
references:
  - https://github.com/albertodemichelis/squirrel/commit/a6413aa690e0bdfef648c68693349a7b878fe60d
  - https://github.com/sprushed/CVE-2022-30292
  - https://lists.fedoraproject.org/archives/list/package-announce%40lists.fedoraproject.org/message/BV7SJJ44AGAX4ILIVPREIXPJ2GOG3FKV/
  - https://lists.fedoraproject.org/archives/list/package-announce%40lists.fedoraproject.org/message/DMIKSVTKNU5FRCUUNAYMCQLOJA3K3S2I/
  - https://lists.fedoraproject.org/archives/list/package-announce%40lists.fedoraproject.org/message/M3FQILX7UUEERSDPMZP3MKGTMY2E7ESU/
  - https://lists.fedoraproject.org/archives/list/package-announce%40lists.fedoraproject.org/message/WBUYGYXDQX3OSAYHP4TCG3JS7PJTIE75/
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1610
  - attack.t1611
  - dragnet.cve
logsource:
  category: container_image_pull
detection:
  selection:
    Image|contains:
      - 'debian:10'
      - 'debian:11'
      - 'debian:13'
      - 'debian:14'
      - 'debian:9'
  condition: selection
falsepositives:
  - Cached images pulled before the vulnerability was published
  - Internal image mirrors that have not been updated
level: critical
