title: 'Dragnet [Container]: dragnet-container-2024-0504 — Vulnerable Base Image Pull'
id: ccb508c0-a551-5c23-bcea-40300811817b
status: deprecated
description: |
  Detects deployment of a container image known to contain a critical vulnerability.
  Incident: dragnet-container-2024-0504 (Tier 2, CVSS 10)
  Envoy is a cloud-native high-performance proxy. In versions prior to 1.22.1 the OAuth filter implementation does not include a mechanism for validating access tokens, so by design when the HMAC signed cookie is missing a full authentication flow should be triggered. However, the current implementation assumes that access tokens are always validated thus allowing access in the presence of any access token attached to the request. Users are advised to upgrade. There is no known workaround for this issue.
  First observed: 2024-11-21.
references:
  - https://access.redhat.com/security/cve/CVE-2022-29226
  - https://github.com/envoyproxy/envoy/commit/7ffda4e809dec74449ebc330cebb9d2f4ab61360
  - https://github.com/envoyproxy/envoy/security/advisories/GHSA-h45c-2f94-prxh
  - https://linux.oracle.com/cve/CVE-2022-29226.html
  - https://linux.oracle.com/errata/ELSA-2022-9589.html
  - https://nvd.nist.gov/vuln/detail/CVE-2022-29226
  - https://www.cve.org/CVERecord?id=CVE-2022-29226
author: dragnet-bot
date: 2026-05-28
tags:
  - attack.t1610
  - attack.t1611
  - dragnet.cve
logsource:
  category: container_image_pull
detection:
  selection:
    Image|contains:
      - 'oraclelinux:7'
      - 'oraclelinux:8'
  condition: selection
falsepositives:
  - Cached images pulled before the vulnerability was published
  - Internal image mirrors that have not been updated
level: critical
