title: 'Dragnet [Ransomware]: dragnet-ransomware-2020-0196 — Shadow Copy Deletion (netwalker)'
id: 20fcbc81-b6e2-56c0-9ffc-3195985d7298
status: deprecated
description: |
  Detects shadow copy deletion commands associated with netwalker ransomware.
  Incident: dragnet-ransomware-2020-0196
  Ransomware victim claim by netwalker: Champaign-Urbana Public Health District; country: US; sector: Public Sector
  First observed: 2020-03-10.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
