title: 'Dragnet [Ransomware]: dragnet-ransomware-2020-0107 — Recovery Inhibition (maze)'
id: 481e091a-fc4f-5927-80a1-4be9af631393
status: experimental
description: |
  Detects boot/recovery disabling associated with maze ransomware.
  Incident: dragnet-ransomware-2020-0107
  Ransomware victim claim by maze: Xerox Corporation; country: GB; sector: Technology
  First observed: 2020-06-25.
  Confidence: 90% (ransomware_live).
references:
  - xerox.com
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
