title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0180 — Recovery Inhibition (lockbit2)'
id: 78f20163-c312-5ce6-b167-acc27b563695
status: deprecated
description: |
  Detects boot/recovery disabling associated with lockbit2 ransomware.
  Incident: dragnet-ransomware-2022-0180
  Ransomware victim claim by lockbit2: fnoutlet.com; sector: Consumer Services
  First observed: 2022-05-06.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
