title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1326 — Event Log Clearing (alphv)'
id: a0a1889e-99c5-582a-90c6-f12010f7f677
status: experimental
description: |
  Detects event log clearing associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-1326
  Ransomware victim claim by alphv: Noble Oil | nobleoilcom; sector: Energy
  First observed: 2022-03-09.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/36e6e9d6-e8a3-41d0-9831-a1dbefb500a3
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
