title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1684 — Event Log Clearing (ransomhouse)'
id: a6af10f4-c142-51c9-9073-33ed301b8b05
status: deprecated
description: |
  Detects event log clearing associated with ransomhouse ransomware.
  Incident: dragnet-ransomware-2022-1684
  Ransomware victim claim by ransomhouse: Republic of Vanuatu; country: VU; sector: Healthcare
  First observed: 2022-12-24.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
