title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-2683 — Event Log Clearing (lockbit3)'
id: 6eaad3b2-1a11-5733-aeab-80db3d0b89ca
status: deprecated
description: |
  Detects event log clearing associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2022-2683
  Ransomware victim claim by lockbit3: veolus.com; sector: Energy
  First observed: 2022-12-12.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
