title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0120 — Recovery Inhibition (cuba)'
id: 0004ed55-af64-5bb8-9439-9330f73a8cfc
status: deprecated
description: |
  Detects boot/recovery disabling associated with cuba ransomware.
  Incident: dragnet-ransomware-2022-0120
  Ransomware victim claim by cuba: delinebox; sector: Not Found
  First observed: 2022-01-10.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
