title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1326 — Recovery Inhibition (alphv)'
id: e66c7129-4554-5c5d-aae3-351257b96ee5
status: experimental
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-1326
  Ransomware victim claim by alphv: Noble Oil | nobleoilcom; sector: Energy
  First observed: 2022-03-09.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/36e6e9d6-e8a3-41d0-9831-a1dbefb500a3
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
