title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1613 — Recovery Inhibition (alphv)'
id: f70f34ff-d316-563e-bbe0-8d17d0e8fe56
status: experimental
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-1613
  Ransomware victim claim by alphv: GEMS Education | gemseducationcom; sector: Education
  First observed: 2022-02-25.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/37227f9e-1402-4d49-83ea-8fb16319f78d
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
