title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1810 — Recovery Inhibition (conti)'
id: 7c7a39f9-b4e5-5d73-b2f0-b7e750ee1134
status: deprecated
description: |
  Detects boot/recovery disabling associated with conti ransomware.
  Incident: dragnet-ransomware-2022-1810
  Ransomware victim claim by conti: Milan Institute; sector: Education
  First observed: 2022-03-17.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
