title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0688 — Recovery Inhibition (alphv)'
id: f448c061-cc26-58dc-907f-f8104ffece17
status: experimental
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0688
  Ransomware victim claim by alphv: SUMITOMO BAKELITE | sbna-inccom; country: JP; sector: Manufacturing
  First observed: 2022-10-27.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/6850c462-1769-4728-86b2-566ebb2e66df
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
