title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0605 — Recovery Inhibition (alphv)'
id: f1925f84-0f05-5e02-8a65-2157128563a7
status: experimental
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0605
  Ransomware victim claim by alphv: inibsacom | inibsadentalcom | inibsanet 2TB FULL DATA; sector: Healthcare
  First observed: 2022-03-22.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/52c61db9-f2e2-4cef-b69a-f75c5e8693a7
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
