title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1041 — Event Log Clearing (alphv)'
id: 0ee960c5-7d21-525c-b6a8-04c51c6f22f8
status: deprecated
description: |
  Detects event log clearing associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-1041
  Ransomware victim claim by alphv: Medical Staff | medicalstaff.com.au; country: AU; sector: Healthcare
  First observed: 2022-02-13.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
