title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1041 — Recovery Inhibition (alphv)'
id: 57590fa5-46ea-5c81-b58b-feebba15fba1
status: deprecated
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-1041
  Ransomware victim claim by alphv: Medical Staff | medicalstaff.com.au; country: AU; sector: Healthcare
  First observed: 2022-02-13.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
