title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1466 — Recovery Inhibition (karakurt)'
id: aa934b1d-f4a5-5a36-8c48-4894081751db
status: experimental
description: |
  Detects boot/recovery disabling associated with karakurt ransomware.
  Incident: dragnet-ransomware-2022-1466
  Ransomware victim claim by karakurt: Regulatory Authority for Telecommunications and Posts (ARTP); sector: Telecommunication
  First observed: 2022-12-11.
  Confidence: 90% (ransomware_live).
references:
  - https://3f7nxkjway3d223j27lyad7v5cgmyaifesycvmwq7i7cbs23lb6llryd.onion/companies/f0f30aac-5a0d-4a45-97bc-fbc8f85d5639
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
