title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0664 — Recovery Inhibition (lockbit3)'
id: 40b62714-8894-5897-abae-2a65f5bf3b6f
status: deprecated
description: |
  Detects boot/recovery disabling associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2022-0664
  Ransomware victim claim by lockbit3: thaiho.com; country: TW; sector: Manufacturing
  First observed: 2022-11-08.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
