title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0910 — Recovery Inhibition (alphv)'
id: dbca518d-f1fd-5b3b-a571-f666d47fa34d
status: experimental
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0910
  Ransomware victim claim by alphv: Maintainco Inc | maintaincocom | starliftcom; sector: Manufacturing
  First observed: 2022-03-22.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/22988430-0867-466c-815e-331e08266b66
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
