title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-2628 — Shadow Copy Deletion (blackbyte)'
id: d55dde5d-edaa-56d5-a8c0-8094359deed2
status: deprecated
description: |
  Detects shadow copy deletion commands associated with blackbyte ransomware.
  Incident: dragnet-ransomware-2022-2628
  Associated with BlackByte.
  Ransomware victim claim by blackbyte: Davin Industries Ltd; country: NZ; sector: Manufacturing
  First observed: 2022-09-11.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
  - dragnet.actor.blackbyte
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
