title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-2778 — Recovery Inhibition (alphv)'
id: 285c4070-b6fc-5dfe-b1c8-7593b45cd8c7
status: experimental
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-2778
  Ransomware victim claim by alphv: Bullfrog International | bullfrogspascom; sector: Consumer Services
  First observed: 2022-03-15.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/dacee923-0f18-4bd9-9ecc-24cb89fa73bf
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
