title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0371 — Recovery Inhibition (alphv)'
id: df75cc34-5fba-5ef3-b5e0-28a0d2ff34b4
status: experimental
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0371
  Ransomware victim claim by alphv: Bradsby Group | bradsbygroupcom; sector: Manufacturing
  First observed: 2022-03-21.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/6008acdf-1054-42a3-88c0-50c73c3965e5
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
