title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1513 — Shadow Copy Deletion (lockbit3)'
id: 92cd95b1-844f-5f98-8e38-d6d6bb68606f
status: deprecated
description: |
  Detects shadow copy deletion commands associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2022-1513
  Ransomware victim claim by lockbit3: happmobi.com.br; country: BR; sector: Technology
  First observed: 2022-10-31.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
