title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0688 — Event Log Clearing (alphv)'
id: 78279ba8-970b-5565-bae8-43e112fb0614
status: experimental
description: |
  Detects event log clearing associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0688
  Ransomware victim claim by alphv: SUMITOMO BAKELITE | sbna-inccom; country: JP; sector: Manufacturing
  First observed: 2022-10-27.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/6850c462-1769-4728-86b2-566ebb2e66df
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
