title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0805 — Recovery Inhibition (cuba)'
id: 65b7b49b-141a-5691-af1a-7efa832d1a80
status: deprecated
description: |
  Detects boot/recovery disabling associated with cuba ransomware.
  Incident: dragnet-ransomware-2022-0805
  Ransomware victim claim by cuba: fdcbuilding; sector: Construction
  First observed: 2022-01-13.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
