title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-3684 — Recovery Inhibition (rhysida)'
id: fa992198-3ce1-56e2-917f-7e848f6e7d46
status: experimental
description: |
  Detects boot/recovery disabling associated with rhysida ransomware.
  Incident: dragnet-ransomware-2024-3684
  Ransomware victim claim by rhysida: ICC; country: US; sector: Manufacturing
  First observed: 2024-05-22.
  Confidence: 90% (ransomware_live).
references:
  - archive.php?company=95
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
