title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-4382 — Event Log Clearing (SilentRansomGroup)'
id: 952b33e6-18a1-5c9f-8e8c-4cbcfc617441
status: deprecated
description: |
  Detects event log clearing associated with SilentRansomGroup ransomware.
  Incident: dragnet-ransomware-2024-4382
  Ransomware victim claim by SilentRansomGroup: Kotz Sangster Wysocki; country: US; sector: Financial Services
  First observed: 2024-12-13.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
