title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1337 — Event Log Clearing (akira)'
id: 159ec4a2-838e-5d12-ad0c-ad926552a595
status: deprecated
description: |
  Detects event log clearing associated with akira ransomware.
  Incident: dragnet-ransomware-2024-1337
  Associated with Akira.
  Ransomware victim claim by akira: Serfilco, RP Adams, Baron Blakeslee, Pacer, Service Filtration of Canada, Polymar.; country: CA; sector: Manufacturing
  First observed: 2024-04-17.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
  - dragnet.actor.akira
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
