title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-5114 — Recovery Inhibition (cloak)'
id: 14eed122-43ba-5bc1-b3b0-c1f02d8afdce
status: deprecated
description: |
  Detects boot/recovery disabling associated with cloak ransomware.
  Incident: dragnet-ransomware-2024-5114
  Ransomware victim claim by cloak: Entr**************.fr; country: FR; sector: Not Found
  First observed: 2024-08-14.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
