title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2642 — Event Log Clearing (akira)'
id: 212cb2ed-862f-5c79-9e07-422e04b5cc54
status: deprecated
description: |
  Detects event log clearing associated with akira ransomware.
  Incident: dragnet-ransomware-2024-2642
  Associated with Akira.
  Ransomware victim claim by akira: Agron (Five Ten) Adidas TERREX; country: DE; sector: Business Services
  First observed: 2024-06-24.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
  - dragnet.actor.akira
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
