title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1045 — Recovery Inhibition (blackbasta)'
id: 360d413a-5b2c-5277-9208-74bec1143b15
status: experimental
description: |
  Detects boot/recovery disabling associated with blackbasta ransomware.
  Incident: dragnet-ransomware-2024-1045
  Ransomware victim claim by blackbasta: doyon.com | doyondrilling.com; country: US; sector: Energy
  First observed: 2024-04-02.
  Confidence: 90% (ransomware_live).
references:
  - http://stniiomyjliimcgkvdszvgen3eaaoz55hreqqx6o77yvmpwt7gklffqd.onion/?id=doyon.com%20|%20doyondrilling.com
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
