title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2373 — Event Log Clearing (rhysida)'
id: 78fee2a8-9bc2-5e78-bc70-40c6d8a98607
status: deprecated
description: |
  Detects event log clearing associated with rhysida ransomware.
  Incident: dragnet-ransomware-2024-2373
  Ransomware victim claim by rhysida: The White Center Community Development Association; country: US; sector: Public Sector
  First observed: 2024-08-13.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
