title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1557 — Recovery Inhibition (hunters)'
id: a37ad6f5-1ab0-5bb3-abe7-41ac03318bc8
status: experimental
description: |
  Detects boot/recovery disabling associated with hunters ransomware.
  Incident: dragnet-ransomware-2024-1557
  Ransomware victim claim by hunters: ATL; country: TN; sector: Business Services
  First observed: 2024-03-12.
  Confidence: 90% (ransomware_live).
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/6859744306
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
