title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-0753 — Recovery Inhibition (ElDorado)'
id: b6b7b9bd-93d8-5cbd-bdf5-13a9dc6e9bd2
status: deprecated
description: |
  Detects boot/recovery disabling associated with ElDorado ransomware.
  Incident: dragnet-ransomware-2024-0753
  Ransomware victim claim by ElDorado: itasnatta.edu.it; country: IT; sector: Education
  First observed: 2024-09-19.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
