title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-5920 — Recovery Inhibition (ransomhub)'
id: 7f5f5661-8b84-52b4-a903-354f3403d170
status: experimental
description: |
  Detects boot/recovery disabling associated with ransomhub ransomware.
  Incident: dragnet-ransomware-2024-5920
  Ransomware victim claim by ransomhub: peorialawyers.com; country: US; sector: Business Services
  First observed: 2024-10-11.
  Confidence: 90% (ransomware_live).
references:
  - http://ransomxifxwc5eteopdobynonjctkxxvap77yqifu2emfbecgbqdw6qd.onion/637f7058-2ddd-4090-9756-4406b8343e69/
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
