title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-4087 — Event Log Clearing (play)'
id: 3df2b089-3339-5dec-8041-152fed6e1fa2
status: experimental
description: |
  Detects event log clearing associated with play ransomware.
  Incident: dragnet-ransomware-2024-4087
  Associated with Play.
  Ransomware victim claim by play: Weldco-Beales Manufacturing; country: CA; sector: Manufacturing
  First observed: 2024-09-03.
  Confidence: 90% (ransomware_live).
references:
  - http://k7kg3jqxang3wh7hnmaiokchk7qoebupfgoik6rha6mjpzwupwtj25yd.onion/topic.php?id=CcJuJrzAclsSF
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
  - dragnet.actor.play
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
