title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1892 — Recovery Inhibition (akira)'
id: 3c54b69c-63ce-59cd-8c21-1f56cdc383a4
status: deprecated
description: |
  Detects boot/recovery disabling associated with akira ransomware.
  Incident: dragnet-ransomware-2024-1892
  Associated with Akira.
  Ransomware victim claim by akira: Yazoo ValleyElectric Power Assosiation; country: US; sector: Energy
  First observed: 2024-08-09.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
  - dragnet.actor.akira
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
