title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2202 — Recovery Inhibition (ransomhub)'
id: 08baea96-8f23-556c-a02a-720a7682890f
status: experimental
description: |
  Detects boot/recovery disabling associated with ransomhub ransomware.
  Incident: dragnet-ransomware-2024-2202
  Ransomware victim claim by ransomhub: www.bfcsolutions.com; sector: Business Services
  First observed: 2024-07-11.
  Confidence: 90% (ransomware_live).
references:
  - http://ransomxifxwc5eteopdobynonjctkxxvap77yqifu2emfbecgbqdw6qd.onion/3a140e74-a2f5-4618-a7cd-e4b332b5256a/
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
