title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-5363 — Event Log Clearing (medusa)'
id: e563608c-6bac-5b94-b295-415c0135961e
status: experimental
description: |
  Detects event log clearing associated with medusa ransomware.
  Incident: dragnet-ransomware-2024-5363
  Ransomware victim claim by medusa: Brodsky Renehan Pearlstein & Bouquet, Chartered; country: US; sector: Business Services
  First observed: 2024-12-05.
  Confidence: 90% (ransomware_live).
references:
  - http://cx5u7zxbvrfyoj6ughw76oa264ucuuizmmzypwum6ear7pct4yc723qd.onion/detail?id=b045be55adc2d1f67c3f02e25e7167af
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
