title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-3319 — Shadow Copy Deletion (safepay)'
id: b46efbd3-5e4a-598e-9f76-8dde68943ab3
status: deprecated
description: |
  Detects shadow copy deletion commands associated with safepay ransomware.
  Incident: dragnet-ransomware-2024-3319
  Ransomware victim claim by safepay: BusinessTraining.be; country: BE; sector: Education
  First observed: 2024-10-18.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
