title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-4187 — Recovery Inhibition (rhysida)'
id: 21d93f22-6728-5c3a-a212-b041fe7f5692
status: experimental
description: |
  Detects boot/recovery disabling associated with rhysida ransomware.
  Incident: dragnet-ransomware-2024-4187
  Ransomware victim claim by rhysida: Sterling Rope; country: US; sector: Manufacturing
  First observed: 2024-08-16.
  Confidence: 90% (ransomware_live).
references:
  - archive.php?company=119
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
