title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2765 — Recovery Inhibition (hunters)'
id: 92ae2f46-00c6-5c5e-96e3-4c16e437a148
status: experimental
description: |
  Detects boot/recovery disabling associated with hunters ransomware.
  Incident: dragnet-ransomware-2024-2765
  Ransomware victim claim by hunters: The Gill Corporation; country: US; sector: Manufacturing
  First observed: 2024-07-29.
  Confidence: 90% (ransomware_live).
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/8154561481
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
