title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-0794 — Recovery Inhibition (lockbit3)'
id: 0fb6a8a5-d309-53d2-b4fc-66171ea41227
status: experimental
description: |
  Detects boot/recovery disabling associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2024-0794
  Ransomware victim claim by lockbit3: livia.in; country: IN; sector: Healthcare
  First observed: 2024-03-14.
  Confidence: 90% (ransomware_live).
references:
  - http://lockbit3olp7oetlc4tl5zydnoluphh7fvdt5oa6arcp2757r7xkutid.onion/post/b6MD9G693NfCnZd8663c96513a214
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
