title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-3841 — Shadow Copy Deletion (qilin)'
id: 5ec32704-f5ad-55dc-8d49-99282f87b122
status: deprecated
description: |
  Detects shadow copy deletion commands associated with qilin ransomware.
  Incident: dragnet-ransomware-2024-3841
  Ransomware victim claim by qilin: ROOSENS BÉTONS; country: BE; sector: Business Services
  First observed: 2024-01-11.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
