title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-4627 — Event Log Clearing (dragonforce)'
id: b9cb78ee-df80-50b9-8daa-a9c0b1ac49ce
status: experimental
description: |
  Detects event log clearing associated with dragonforce ransomware.
  Incident: dragnet-ransomware-2024-4627
  Ransomware victim claim by dragonforce: Cogitis; country: FR; sector: Technology
  First observed: 2024-12-12.
  Confidence: 90% (ransomware_live).
references:
  - http://z3wqggtxft7id3ibr7srivv5gjof5fwg76slewnzwwakjuf3nlhukdid.onion/blog/?post_uuid=74c06b0d-5ce8-4939-8b11-64070706a54f
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
