title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1141 — Recovery Inhibition (qilin)'
id: 0003a4fb-0324-5359-8ec6-52ee18bad98b
status: experimental
description: |
  Detects boot/recovery disabling associated with qilin ransomware.
  Incident: dragnet-ransomware-2024-1141
  Ransomware victim claim by qilin: Primary Plus; country: LU; sector: Healthcare
  First observed: 2024-12-11.
  Confidence: 90% (ransomware_live).
references:
  - http://ijzn3sicrcy7guixkzjkib4ukbiilwc3xhnmby4mcbccnsd7j2rekvqd.onion/site/view?uuid=b8a71cb6-a08e-3c20-ab83-c4606126a4f2
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
