title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2511 — Recovery Inhibition (play)'
id: cdb31f99-56f5-558b-947c-afc8ce7625c9
status: experimental
description: |
  Detects boot/recovery disabling associated with play ransomware.
  Incident: dragnet-ransomware-2024-2511
  Associated with Play.
  Ransomware victim claim by play: Southern Specialty & Supply; country: US; sector: Not Found
  First observed: 2024-05-07.
  Confidence: 90% (ransomware_live).
references:
  - http://k7kg3jqxang3wh7hnmaiokchk7qoebupfgoik6rha6mjpzwupwtj25yd.onion/topic.php?id=SjdzErzOsvz3iR
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
  - dragnet.actor.play
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
