title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-3676 — Recovery Inhibition (funksec)'
id: beb92d5d-0d53-55bb-8804-4b7ad196b943
status: experimental
description: |
  Detects boot/recovery disabling associated with funksec ransomware.
  Incident: dragnet-ransomware-2024-3676
  Ransomware victim claim by funksec: singularanalysts.com; country: IN; sector: Technology
  First observed: 2024-12-10.
  Confidence: 90% (ransomware_live).
references:
  - http://7ixfdvqb4eaju5lzj4gg76kwlrxg4ugqpuog5oqkkmgfyn33h527oyyd.onion/Breach25.html
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
