title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-0278 — Recovery Inhibition (akira)'
id: bdc708f4-1577-5a0c-88a6-4b1be4bd0d4f
status: deprecated
description: |
  Detects boot/recovery disabling associated with akira ransomware.
  Incident: dragnet-ransomware-2024-0278
  Associated with Akira.
  Ransomware victim claim by akira: OL Products; country: US; sector: Consumer Services
  First observed: 2024-12-18.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
  - dragnet.actor.akira
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
