title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1848 — Recovery Inhibition (underground)'
id: 637f1385-197d-5c3c-b8dd-f6074f10e858
status: experimental
description: |
  Detects boot/recovery disabling associated with underground ransomware.
  Incident: dragnet-ransomware-2024-1848
  Ransomware victim claim by underground: Casio Computer Co., Ltd; country: JP; sector: Technology
  First observed: 2024-10-09.
  Confidence: 90% (ransomware_live).
references:
  - http://47glxkuxyayqrvugfumgsblrdagvrah7gttfscgzn56eyss5wg3uvmqd.onion/packages/86454fab-3c15-4a88-bde9-a62778117c44
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
