
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2020-0107 — Ransomware C2 Communication'
id: d03f911f-8957-591d-acbf-795f9d2c7403
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2020-0107
  Ransomware victim claim by maze: Xerox Corporation; country: GB; sector: Technology
  First observed: 2020-06-25.
  Confidence: 90% (ransomware_live).
references:
  - xerox.com
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
