
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2022-2429 — Ransomware C2 Communication'
id: 977e88a1-84d9-5025-a6da-d31e5bfcc815
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2022-2429
  Ransomware victim claim by alphv: Rudsak Inc | rudsakcom; sector: Consumer Services
  First observed: 2022-03-28.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/f147f958-caa9-4262-83b3-6e96d48a26d7
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/f147f958-caa9-4262-83b3-6e96d48a26d7'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
