
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2022-2778 — Ransomware C2 Communication'
id: cb27f779-f593-5571-bbed-2a368e5e7dbf
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2022-2778
  Ransomware victim claim by alphv: Bullfrog International | bullfrogspascom; sector: Consumer Services
  First observed: 2022-03-15.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/dacee923-0f18-4bd9-9ecc-24cb89fa73bf
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/dacee923-0f18-4bd9-9ecc-24cb89fa73bf'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
