
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2022-0688 — Ransomware C2 Communication'
id: f0e176ae-44cf-5491-9295-653d54b45290
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2022-0688
  Ransomware victim claim by alphv: SUMITOMO BAKELITE | sbna-inccom; country: JP; sector: Manufacturing
  First observed: 2022-10-27.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/6850c462-1769-4728-86b2-566ebb2e66df
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/6850c462-1769-4728-86b2-566ebb2e66df'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
