
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2022-0605 — Ransomware C2 Communication'
id: 42522836-e9c3-5a55-9faa-864ac00e347a
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2022-0605
  Ransomware victim claim by alphv: inibsacom | inibsadentalcom | inibsanet 2TB FULL DATA; sector: Healthcare
  First observed: 2022-03-22.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/52c61db9-f2e2-4cef-b69a-f75c5e8693a7
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/52c61db9-f2e2-4cef-b69a-f75c5e8693a7'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
