
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2022-0143 — Ransomware C2 Communication'
id: b22c617d-8605-5064-b7ed-73242954932a
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2022-0143
  Ransomware victim claim by alphv: Phyllis Browning Company | phyllisbrowningcom; sector: Manufacturing
  First observed: 2022-02-18.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/4b4dc9d0-daf8-4527-a983-54440ad8b911
author: dragnet-bot
date: 2026-05-28
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/4b4dc9d0-daf8-4527-a983-54440ad8b911'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
