
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2022-1019 — Ransomware C2 Communication'
id: 69c356df-d71e-5145-9c48-e6d9f3361724
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2022-1019
  Ransomware victim claim by alphv: Quantel Medical | quantel-medicalcom; sector: Healthcare
  First observed: 2022-02-18.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/f40fa4ec-80a9-4741-9746-320f278aa71c
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/f40fa4ec-80a9-4741-9746-320f278aa71c'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
