
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2022-0910 — Ransomware C2 Communication'
id: 45cde7e1-ad36-5922-b66e-726bc6a0f686
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2022-0910
  Ransomware victim claim by alphv: Maintainco Inc | maintaincocom | starliftcom; sector: Manufacturing
  First observed: 2022-03-22.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/22988430-0867-466c-815e-331e08266b66
author: dragnet-bot
date: 2026-05-28
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/22988430-0867-466c-815e-331e08266b66'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
