
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2022-2986 — Ransomware C2 Communication'
id: 3b0613ca-1838-5ab5-bc67-516599ffc425
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2022-2986
  Ransomware victim claim by alphv: bet9jacom | goldbetit; sector: Consumer Services
  First observed: 2022-04-06.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/683f74fc-b6b4-4de6-9c20-2886a956bcaf
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/683f74fc-b6b4-4de6-9c20-2886a956bcaf'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
