
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2022-1613 — Ransomware C2 Communication'
id: fa2fc882-36dd-50e8-aedc-eaa6069b2102
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2022-1613
  Ransomware victim claim by alphv: GEMS Education | gemseducationcom; sector: Education
  First observed: 2022-02-25.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/37227f9e-1402-4d49-83ea-8fb16319f78d
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/37227f9e-1402-4d49-83ea-8fb16319f78d'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
