
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2022-0654 — Ransomware C2 Communication'
id: 23d81ae0-6fe5-5730-892d-524a06c09634
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2022-0654
  Ransomware victim claim by clop: STANFORD.EDU; country: US; sector: Education
  First observed: 2022-12-22.
  Confidence: 90% (ransomware_live).
references:
  - http://santat7kpllt6iyvqbr7q4amdv6dzrh6paatvyrzl7ry3zm72zigf4ad.onion/stanford-edu
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://santat7kpllt6iyvqbr7q4amdv6dzrh6paatvyrzl7ry3zm72zigf4ad.onion/stanford-edu'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
