
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2022-0371 — Ransomware C2 Communication'
id: 86b8f6cf-8614-566a-967e-f5854f2075a5
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2022-0371
  Ransomware victim claim by alphv: Bradsby Group | bradsbygroupcom; sector: Manufacturing
  First observed: 2022-03-21.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/6008acdf-1054-42a3-88c0-50c73c3965e5
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/6008acdf-1054-42a3-88c0-50c73c3965e5'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
