
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2022-2565 — Ransomware C2 Communication'
id: 2c6b1557-5c6d-531d-8a56-fb37a6479a70
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2022-2565
  Ransomware victim claim by alphv: Scherr Legate | scherrlegatecom; sector: Business Services
  First observed: 2022-02-08.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/52f40157-5e7a-471d-9339-c5f9e051f293
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/52f40157-5e7a-471d-9339-c5f9e051f293'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
