
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2022-2761 — Ransomware C2 Communication'
id: d0131c5f-9d00-554e-af2f-7428e7a8b38a
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2022-2761
  Ransomware victim claim by alphv: Events DC | eventsdccom; sector: Hospitality and Tourism
  First observed: 2022-10-14.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/bc4a2074-d980-48a9-b0c1-aa53681cb89a
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/bc4a2074-d980-48a9-b0c1-aa53681cb89a'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
