
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2022-1117 — Ransomware C2 Communication'
id: a88f4c8c-cbfa-54f1-82c3-ba57e896e5b6
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2022-1117
  Ransomware victim claim by alphv: The People's Federal Credit Union | tpfcucom; sector: Financial Services
  First observed: 2022-05-09.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/bc6d70e6-164f-43f0-81fe-16fdeb257ff6
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/bc6d70e6-164f-43f0-81fe-16fdeb257ff6'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
