
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-6461 — Ransomware C2 Communication'
id: a499fc5c-fdf3-574a-b3d2-df58e6ef79af
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-6461
  Ransomware victim claim by babuk2: nrru.ac.th - University; country: TH; sector: Education
  First observed: 2025-03-15.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/5a53eb10748f0117aaad6cba285ba46741fa0ad62a76966d702b51fad300978a/
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
