
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-1596 — Ransomware C2 Communication'
id: 5850e5fc-e673-5b4e-880c-08248df5463e
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-1596
  Ransomware victim claim by payoutsking: Schlemmer Holding GmbH; country: DE; sector: Manufacturing
  First observed: 2025-07-07.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/detail_post/H2TjrDu9ReB9bk5veTXH
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
