
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-4388 — Ransomware C2 Communication'
id: 6bd6a2ca-a045-5e7c-b0a1-77f9f36de31b
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-4388
  Ransomware victim claim by payoutsking: Monterey Mushrooms; country: US; sector: Agriculture and Food Production
  First observed: 2025-08-08.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/detail_post/JJLeZuIeagvz0qShFOlu
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
