
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-1289 — Ransomware C2 Communication'
id: c8be74da-7a60-58ac-bc17-2228b052b107
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-1289
  Ransomware victim claim by babuk2: airexplore.aero Company; country: SK; sector: Transportation/Logistics
  First observed: 2025-03-11.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/4023769a291fcd5f8df62b554766b76c0ee230fa38add89b95869d776bb96581/
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
