
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-4353 — Ransomware C2 Communication'
id: 1940631f-e90b-5b7d-8d94-58bd21d3d915
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-4353
  Ransomware victim claim by payoutsking: Klüber Elektroanlagenbau GmbH; country: DE; sector: Manufacturing
  First observed: 2025-11-17.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/post/5qgLmp6Wa2HxPmaQi53v
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
