
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-1375 — Ransomware C2 Communication'
id: 59567f90-1d55-5079-a4f6-659aa5db7e67
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-1375
  Ransomware victim claim by babuk2: armetal.com; country: SA; sector: Manufacturing
  First observed: 2025-03-21.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/d6c2af1136713d35a9c294992cbed89b7dd21acca7ff34b0549291a2eef5f4cd/
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
