
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-4586 — Ransomware C2 Communication'
id: 9ceeadad-cd7b-520b-9707-b0df8c7150f6
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-4586
  Ransomware victim claim by babuk2: pti.agency; country: DE; sector: Not Found
  First observed: 2025-01-27.
  Confidence: 90% (ransomware_live).
references:
  - http:/7dikawx73goypgfi4zyo5fcajxwb7agemmiwqax3p54aey4dwobcvcyd.onion/blog/00b2166002a46d2c1f0677b1e0da903b062734a5166c18de1d2d4e01ad295e23/
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
