
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-7185 — Ransomware C2 Communication'
id: 0756a3e5-9793-52f3-9b87-f4e88c00535d
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-7185
  Ransomware victim claim by payoutsking: Irwin Car; country: US; sector: Manufacturing
  First observed: 2025-11-03.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/post/1lbd92QrbHpajjrl7Hmo
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
