
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-2190 — Ransomware C2 Communication'
id: c733d98b-3c48-55ea-aa6f-bb26ae463c61
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-2190
  Ransomware victim claim by babuk2: pureincubation.com; country: US; sector: Technology
  First observed: 2025-03-28.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/aca6f28085ad9c62056267f1ed82b5ae0da3a3b9ef4d30654028306e7ae7892d/
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
