
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-5450 — Ransomware C2 Communication'
id: 713e23ae-de70-5014-9e38-70bb126c23ad
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-5450
  Ransomware victim claim by safepay: distribution2.com; country: DE; sector: Not Found
  First observed: 2025-04-23.
  Confidence: 90% (ransomware_live).
references:
  - http://j3dp6okmaklajrsk6zljl5sfa2vpui7j2w6cwmhmmqhab6frdfbphhid.onion#distribution2
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://j3dp6okmaklajrsk6zljl5sfa2vpui7j2w6cwmhmmqhab6frdfbphhid.onion#distribution2'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
