
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-2881 — Ransomware C2 Communication'
id: 66d88183-4ecc-5ab3-a81d-533d14fabe18
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-2881
  Ransomware victim claim by payoutsking: Institute of Culinary Education; country: US; sector: Education
  First observed: 2025-05-28.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/detail_post/chnYzXRfSeoWiVb49nEg
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
