
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-7114 — Ransomware C2 Communication'
id: ed7f0338-4244-53ca-ba56-de00e1996058
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-7114
  Ransomware victim claim by babuk2: workers.com.zm; country: ZM; sector: Not Found
  First observed: 2025-01-27.
  Confidence: 90% (ransomware_live).
references:
  - http:/7dikawx73goypgfi4zyo5fcajxwb7agemmiwqax3p54aey4dwobcvcyd.onion/blog/b97904dfa9f56c1edd2c4bc06a22786ff9ec1bb76c4e5717796b18ca076bbbb5/
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
