
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-5521 — Ransomware C2 Communication'
id: 884a9341-aede-5893-8825-f7424a80748f
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-5521
  Ransomware victim claim by beast: Cain Electric; country: US; sector: Construction
  First observed: 2025-03-31.
  Confidence: 90% (ransomware_live).
references:
  - http://beast6azu4f7fxjakiayhnssybibsgjnmy77a6duufqw5afjzfjhzuqd.onion/card/cain_electric
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://beast6azu4f7fxjakiayhnssybibsgjnmy77a6duufqw5afjzfjhzuqd.onion/card/cain_electric'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
