
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-5615 — Ransomware C2 Communication'
id: 1c87c45f-80e4-5839-afe2-7b6a5540c79d
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-5615
  Ransomware victim claim by payoutsking: Linxx Global Solutions; country: US; sector: Business Services
  First observed: 2025-09-30.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/post/grGKKcGyXjqmjUkpaJLI
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
