
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-1648 — Ransomware C2 Communication'
id: 88b52bde-22e3-5fc8-8b22-e879afed4c36
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-1648
  Ransomware victim claim by babuk2: Secret plans of Indian army; sector: Public Sector
  First observed: 2025-04-03.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/2664a048808608b55bbfa9530f2a2233d5e421cec77a17dc6024999a5520a616/
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
