
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-5948 — Ransomware C2 Communication'
id: 609cd472-7167-5ac4-956e-d54c692d222c
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-5948
  Ransomware victim claim by payoutsking: Gateway Community; country: US; sector: Education
  First observed: 2025-04-28.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/detail_post/9hBxLOOPn1pZxCJ26DuZ
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
