
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-3753 — Ransomware C2 Communication'
id: 7a6afe2c-cb92-5260-9b2d-a0b3d3aae9de
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-3753
  Ransomware victim claim by babuk2: Corporate access, up to Shipping Apps in QATAR; country: QA; sector: Transportation/Logistics
  First observed: 2025-03-20.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/345b9d9a8ff8d46121bcb22a787654becef59c35fa7f13e5489693a22437268d/
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
