
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-0284 — Ransomware C2 Communication'
id: 0d41bd88-ae6c-59ee-8a04-bef72f9406fc
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-0284
  Ransomware victim claim by killsec: Nydegger + Finger AG; country: CH; sector: Construction
  First observed: 2025-04-01.
  Confidence: 90% (ransomware_live).
references:
  - http://ks5424y3wpr5zlug5c7i6svvxweinhbdcqcfnptkfcutrncfazzgz5id.onion/posts.php?pid=ersOVRsLer1h07IrREdVHNvS
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://ks5424y3wpr5zlug5c7i6svvxweinhbdcqcfnptkfcutrncfazzgz5id.onion/posts.php?pid=ersOVRsLer1h07IrREdVHNvS'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
