
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-6728 — Ransomware C2 Communication'
id: 18068bf6-62ec-5618-b7b7-6e6b9ac16bcc
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-6728
  Ransomware victim claim by babuk2: www.gob.ve; country: VE; sector: Public Sector
  First observed: 2025-03-19.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/5b916d9daf1fb72df54bcb4df35d625cb628b2e19f737e4171e332bed995b745/
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
