
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-1498 — Ransomware C2 Communication'
id: 62edcb8a-2a93-543e-a376-bea5479e5c61
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-1498
  Ransomware victim claim by babuk2: moh.gov.rw; country: RW; sector: Public Sector
  First observed: 2025-03-31.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/3cffe910ca10097b9f862b6169e98e1667aaae8d002c66f00186094a16095306/
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
