
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-5344 — Ransomware C2 Communication'
id: 725ad688-57b5-5358-b0c1-d86090e781ad
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-5344
  Ransomware victim claim by apt73: coel.com.mx; country: MX; sector: Technology
  First observed: 2025-02-03.
  Confidence: 90% (ransomware_live).
references:
  - http://basherq53eniermxovo3bkduw5qqq5bkqcml3qictfmamgvmzovykyqd.onion/page_company.php?id=119
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://basherq53eniermxovo3bkduw5qqq5bkqcml3qictfmamgvmzovykyqd.onion/page_company.php?id=119'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
