
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-4308 — Ransomware C2 Communication'
id: 356f176b-272d-5cf3-9e84-b900ea06e523
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-4308
  Ransomware victim claim by babuk2: web.asia.edu.tw - Taiwan (Asia University); country: TW; sector: Education
  First observed: 2025-03-14.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/1ab5f193436e8e5bac8c4accc7a225451aa0ed1ca4e6d65d8a1491dc289a84f0/
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
