
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-6652 — Ransomware C2 Communication'
id: e8671fdc-0601-5025-ae68-d4a03371c5c9
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-6652
  Ransomware victim claim by blackshrantac: MultistateTax Inc; country: US; sector: Financial Services
  First observed: 2025-11-13.
  Confidence: 90% (ransomware_live).
references:
  - http://b2ykcy2gcug4gnccm6hnrb5xapnresmyjjqgvhafaypppwgo4feixwyd.onion/targets/27
author: dragnet-bot
date: 2026-05-28
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://b2ykcy2gcug4gnccm6hnrb5xapnresmyjjqgvhafaypppwgo4feixwyd.onion/targets/27'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
