
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-7003 — Ransomware C2 Communication'
id: 57188768-2aff-5995-bbe6-86132966a46c
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-7003
  Ransomware victim claim by payoutsking: Sofo Foods; country: US; sector: Agriculture and Food Production
  First observed: 2025-08-05.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/detail_post/D4OWGfMsgjgXMcZkj0GM
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
