
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-3676 — Ransomware C2 Communication'
id: 9a3229f0-f8d3-53b3-a0ab-6c80c6b0b261
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-3676
  Ransomware victim claim by babuk2: www.rekamy.com; country: MY; sector: Technology
  First observed: 2025-01-27.
  Confidence: 90% (ransomware_live).
references:
  - http:/7dikawx73goypgfi4zyo5fcajxwb7agemmiwqax3p54aey4dwobcvcyd.onion/blog/99b5f21e6809fa3b3992cf6ba1ef0b3cd8850ff3910cbdd76f9dd2ecd5e68dc9/
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
