
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-6872 — Ransomware C2 Communication'
id: 973a8c63-2f63-512e-9614-d39724011f54
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-6872
  Ransomware victim claim by babuk2: www.shootinghouse.com.br; country: BR; sector: Not Found
  First observed: 2025-01-27.
  Confidence: 90% (ransomware_live).
references:
  - http:/7dikawx73goypgfi4zyo5fcajxwb7agemmiwqax3p54aey4dwobcvcyd.onion/blog/c0b63c60d94025eff1accba59f0f42fd8a932576faf925c2cd5044201bd98676/
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
