
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-7244 — Ransomware C2 Communication'
id: ae6a4566-ab43-5a8f-add3-51b1acdc3b43
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-7244
  Ransomware victim claim by rhysida: Forrest City School District; country: US; sector: Education
  First observed: 2025-03-28.
  Confidence: 90% (ransomware_live).
references:
  - http://rhysidafohrhyy2aszi7bm32tnjat5xri65fopcxkdfxhi4tidsg7cad.onion/archive.php?auction/archive.php?company=175
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://rhysidafohrhyy2aszi7bm32tnjat5xri65fopcxkdfxhi4tidsg7cad.onion/archive.php?auction/archive.php?company=175'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
