
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-1007 — Ransomware C2 Communication'
id: 71f38f63-66b6-55f8-a3ed-a8e03a2a0718
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-1007
  Ransomware victim claim by ransomhub: www.americanstandard-us.com; country: US; sector: Manufacturing
  First observed: 2025-01-22.
  Confidence: 90% (ransomware_live).
references:
  - http://ransomxifxwc5eteopdobynonjctkxxvap77yqifu2emfbecgbqdw6qd.onion/bbe0c0a5-e05e-4d06-b7f7-bb654f1e45f1/
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://ransomxifxwc5eteopdobynonjctkxxvap77yqifu2emfbecgbqdw6qd.onion/bbe0c0a5-e05e-4d06-b7f7-bb654f1e45f1/'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
