
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-0567 — Ransomware C2 Communication'
id: 9bbbf70d-3a43-5bf0-88c2-ac9d8f28642c
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-0567
  Ransomware victim claim by payoutsking: EvoluPharm; country: FR; sector: Healthcare
  First observed: 2025-05-12.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/detail_post/YMUjz75x9S7iKQVEoEjd
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
