
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-1238 — Ransomware C2 Communication'
id: f0d540bf-1598-562a-9198-c33a309ee5b4
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-1238
  Ransomware victim claim by payoutsking: Time Equities; country: US; sector: Financial Services
  First observed: 2025-10-22.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/post/X7Z1qJAQva5dXYuyPh1L
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
