
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-1265 — Ransomware C2 Communication'
id: 6d4b001c-0728-573a-b707-bb4c59ff8af8
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-1265
  Ransomware victim claim by payoutsking: CR Architecture + Design; country: US; sector: Construction
  First observed: 2025-05-05.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/detail_post/Zft4JTSjCELxKLjp9JgW
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
