
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-6267 — Ransomware C2 Communication'
id: ea4283f4-e3c9-5ffd-b528-95d639ad5890
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-6267
  Ransomware victim claim by payoutsking: BARIATRIX NUTRITION; country: CA; sector: Healthcare
  First observed: 2025-04-17.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/detail_post/5p2EHbutxBZj61evrdE1
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
