
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-5166 — Ransomware C2 Communication'
id: 31d37d8e-ab6c-559d-99de-3caa3d7d7328
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-5166
  Ransomware victim claim by babuk2: unired.uz; country: UZ; sector: Not Found
  First observed: 2025-03-28.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/13c7043c26410b6568290e470887eac03d5639a5ff14afe5bf3b7cb0ba73b917/
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
