
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-3496 — Ransomware C2 Communication'
id: 7d59224d-1a4c-5ede-afc9-2a0e347455f0
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-3496
  Ransomware victim claim by payoutsking: KOLBUS; country: DE; sector: Manufacturing
  First observed: 2025-06-16.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/detail_post/oKY1d9ecPiblLrKXQb8y
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
