
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-0921 — Ransomware C2 Communication'
id: 35cb6997-6d78-53b1-9947-c6584403c218
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-0921
  Ransomware victim claim by babuk2: smic.mi.th (Thailand Intelligence Agency); country: TH; sector: Public Sector
  First observed: 2025-03-20.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/1801921261dfee2323d1805c368ef40de7f9ea55a9c81b786eb119fdaceff14e/
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
