
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-4008 — Ransomware C2 Communication'
id: db955a07-282e-5174-8499-46442b513071
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-4008
  Ransomware victim claim by payoutsking: Thompson+Hanson; country: US; sector: Business Services
  First observed: 2025-07-14.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/detail_post/FBkIuvZP5AkSllFqhzrM
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
