
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-7285 — Ransomware C2 Communication'
id: d5f2bce2-e839-5ac4-be74-3305dc7dad80
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-7285
  Ransomware victim claim by spacebears: EBL PARTNERS (construction|interiors), Florida; country: US; sector: Business Services
  First observed: 2025-01-08.
  Confidence: 90% (ransomware_live).
references:
  - http://5butbkrljkaorg5maepuca25oma7eiwo6a2rlhvkblb4v6mf3ki2ovid.onion/companies/29/ebl-partners-constructioninteriors-florida
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://5butbkrljkaorg5maepuca25oma7eiwo6a2rlhvkblb4v6mf3ki2ovid.onion/companies/29/ebl-partners-constructioninteriors-florida'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
