
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-3006 — Ransomware C2 Communication'
id: 64da5999-39a3-5daf-91bb-63d19647ec13
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-3006
  Ransomware victim claim by payoutsking: Silent Gliss Italia; country: IT; sector: Manufacturing
  First observed: 2025-05-26.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/detail_post/2mI3qv14Gm6K5IcIVqcP
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
