
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-7187 — Ransomware C2 Communication'
id: 0d3cb5a3-d0ef-528a-af52-fa6a31b8ac24
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-7187
  Ransomware victim claim by babuk2: Mandarin.com.br; country: BR; sector: Consumer Services
  First observed: 2025-03-10.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/21a5e7905a0c2544593cc8856fc4190f3c5cd9dea2922b15adf9cc5582bde4b7/
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
