
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-3693 — Ransomware C2 Communication'
id: e282010f-cf09-5de7-b6e8-f3ceaa97448e
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-3693
  Ransomware victim claim by payoutsking: Rhea Vendors Group SpA; country: IT; sector: Manufacturing
  First observed: 2025-04-24.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/detail_post/JsUQzT31KGLFyR1sFcut
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
