
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-2095 — Ransomware C2 Communication'
id: 93a3e8cc-0e57-5c79-95c2-9839b28d2bf0
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-2095
  Ransomware victim claim by babuk2: zapopan.gob.mx; country: MX; sector: Public Sector
  First observed: 2025-01-27.
  Confidence: 90% (ransomware_live).
references:
  - http:/7dikawx73goypgfi4zyo5fcajxwb7agemmiwqax3p54aey4dwobcvcyd.onion/blog/15f2b93e929d7acc1e24dfd6b25ab9f5c7144e70d305869c0d3685e63525bf40/
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
