
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-0093 — Ransomware C2 Communication'
id: acd4f585-732f-5774-9121-1e4a16876c57
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-0093
  Associated with Play.
  Ransomware victim claim by play: Story Environmental; country: CA; sector: Energy
  First observed: 2025-01-31.
  Confidence: 90% (ransomware_live).
references:
  - http://mbrlkbtq5jonaqkurjwmxftytyn2ethqvbxfu4rgjbkkknndqwae6byd.onion/topic.php?id=tcjJwQQ5SsfrCx
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
  - dragnet.actor.play
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://mbrlkbtq5jonaqkurjwmxftytyn2ethqvbxfu4rgjbkkknndqwae6byd.onion/topic.php?id=tcjJwQQ5SsfrCx'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
