
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-7867 — Ransomware C2 Communication'
id: 2a507c42-6976-5dfd-ad50-8080c6ba0fbb
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-7867
  Ransomware victim claim by babuk2: leadzen.ai; country: IN; sector: Technology
  First observed: 2025-03-28.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/8b4ba9a7921f9cedc14275f97019a1c2717ee9d99a108241fbb94368079647c2/
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
