
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-7420 — Ransomware C2 Communication'
id: ba6e37c9-2cee-50e5-9b46-1451c749fb0d
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-7420
  Ransomware victim claim by babuk2: highwirepress.com; country: US; sector: Technology
  First observed: 2025-03-18.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/636b3338cfa6d08872c31304c45c383971e7705648e43cc2e004c6ccfcc92d18/
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
