
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-4504 — Ransomware C2 Communication'
id: aefa49c1-7ddb-5baf-ad9d-9a85f0b7b027
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2025-4504
  Ransomware victim claim by payoutsking: Crenshaw Community Hospital; country: US; sector: Healthcare
  First observed: 2025-05-13.
  Confidence: 90% (ransomware_live).
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/detail_post/Vl7kgk4ikeixwrXDYhrE
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
