title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-1865 — Recovery Inhibition (babuk2)'
id: c942aeb3-bbed-5563-8508-96a978535c57
status: experimental
description: |
  Detects boot/recovery disabling associated with babuk2 ransomware.
  Incident: dragnet-ransomware-2025-1865
  Ransomware victim claim by babuk2: ezbuy.sg (Singapore Shopping); country: SG; sector: Consumer Services
  First observed: 2025-04-03.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/2c966665d042a6e2df14b38f689f14a7007e4749ce21f663c47a7a74b9716e95/
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
