title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-1433 — Event Log Clearing (blackshrantac)'
id: acb6b6f7-0733-5db4-9d02-ce87533e23f9
status: experimental
description: |
  Detects event log clearing associated with blackshrantac ransomware.
  Incident: dragnet-ransomware-2025-1433
  Ransomware victim claim by blackshrantac: libertyshoes, Inc; country: IN; sector: Consumer Services
  First observed: 2025-11-13.
  Confidence: 90% (ransomware_live).
references:
  - http://b2ykcy2gcug4gnccm6hnrb5xapnresmyjjqgvhafaypppwgo4feixwyd.onion/targets/28
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
