title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-0570 — Event Log Clearing (babuk2)'
id: d88e6bcc-7a60-526e-8e03-cc5698018391
status: experimental
description: |
  Detects event log clearing associated with babuk2 ransomware.
  Incident: dragnet-ransomware-2025-0570
  Ransomware victim claim by babuk2: uniproof.com.br; country: BR; sector: Not Found
  First observed: 2025-04-01.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/045c0a8453ce102e458e3a150f2eb7fbc86185bd40c0c22be5763681d2b02dc7/
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
