title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-7546 — Recovery Inhibition (rhysida)'
id: 363e9635-2cfa-5374-b093-467db9d9b026
status: experimental
description: |
  Detects boot/recovery disabling associated with rhysida ransomware.
  Incident: dragnet-ransomware-2025-7546
  Ransomware victim claim by rhysida: ORU Mabee Center; country: US; sector: Education
  First observed: 2025-01-24.
  Confidence: 90% (ransomware_live).
references:
  - archive.php?company=158
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
