title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-7157 — Event Log Clearing (interlock)'
id: 8da0c042-ff72-5793-9a2f-822e1880ca03
status: experimental
description: |
  Detects event log clearing associated with interlock ransomware.
  Incident: dragnet-ransomware-2025-7157
  Ransomware victim claim by interlock: WC Smith; country: US; sector: Business Services
  First observed: 2025-05-14.
  Confidence: 90% (ransomware_live).
references:
  - http://ebhmkoohccl45qesdbvrjqtyro2hmhkmh6vkyfyjjzfllm3ix72aqaid.onion/leaks.phphttp://iwdzb7nnphh2rffdygryptldmr5ip3lk6dejfwn6qlbtvyipqxzbwdyd.onion/index.php?p=
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
