title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-5221 — Event Log Clearing (akira)'
id: 2c97dad8-b403-5c02-b0e2-0e4198c5c653
status: deprecated
description: |
  Detects event log clearing associated with akira ransomware.
  Incident: dragnet-ransomware-2025-5221
  Associated with Akira.
  Ransomware victim claim by akira: PLP SoCal; country: US; sector: Construction
  First observed: 2025-10-18.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
  - dragnet.actor.akira
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
