title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-5775 — Shadow Copy Deletion (nightspire)'
id: 1b43da2b-dbf1-548f-9e2b-d1ca2387842d
status: deprecated
description: |
  Detects shadow copy deletion commands associated with nightspire ransomware.
  Incident: dragnet-ransomware-2025-5775
  Ransomware victim claim by nightspire: MFR CULTIVONS LES REUSSITES, France; country: FR; sector: Agriculture and Food Production
  First observed: 2025-04-21.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
