title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-6264 — Event Log Clearing (akira)'
id: 5d0c658f-6cfd-5357-ad69-aefba7863689
status: deprecated
description: |
  Detects event log clearing associated with akira ransomware.
  Incident: dragnet-ransomware-2025-6264
  Associated with Akira.
  Ransomware victim claim by akira: Smith Gardner; country: US; sector: Business Services
  First observed: 2025-10-14.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
  - dragnet.actor.akira
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
