title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-0012 — Event Log Clearing (akira)'
id: 4d805432-de6f-5111-b4e0-45b9b767d6a1
status: deprecated
description: |
  Detects event log clearing associated with akira ransomware.
  Incident: dragnet-ransomware-2025-0012
  Associated with Akira.
  Ransomware victim claim by akira: Rodenburg Law Firm; country: US; sector: Business Services
  First observed: 2025-12-09.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1070.001
  - dragnet.ransomware
  - dragnet.actor.akira
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
