title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-3518 — Recovery Inhibition (qilin)'
id: 811af245-5936-5e05-812f-c29fedc772bb
status: experimental
description: |
  Detects boot/recovery disabling associated with qilin ransomware.
  Incident: dragnet-ransomware-2025-3518
  Ransomware victim claim by qilin: volinc.com; country: US; sector: Transportation/Logistics
  First observed: 2025-09-13.
  Confidence: 90% (ransomware_live).
references:
  - http://ijzn3sicrcy7guixkzjkib4ukbiilwc3xhnmby4mcbccnsd7j2rekvqd.onion/site/view?uuid=16f936fa-8047-3e17-8d8b-902d4307da68
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
