title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-7192 — Shadow Copy Deletion (rhysida)'
id: 41eab9b8-fd48-51af-bd3d-74792fc664a0
status: deprecated
description: |
  Detects shadow copy deletion commands associated with rhysida ransomware.
  Incident: dragnet-ransomware-2025-7192
  Ransomware victim claim by rhysida: Peavey Electronics Corporation; country: US; sector: Manufacturing
  First observed: 2025-09-29.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
