title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-4205 — Recovery Inhibition (sarcoma)'
id: f9667fd1-dd21-58be-ac59-01ab1fcc2dad
status: deprecated
description: |
  Detects boot/recovery disabling associated with sarcoma ransomware.
  Incident: dragnet-ransomware-2025-4205
  Ransomware victim claim by sarcoma: The PNST; sector: Business Services
  First observed: 2025-03-26.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
