title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-0315 — Recovery Inhibition (akira)'
id: 60012554-fdc9-5c14-9b90-088b91c26556
status: deprecated
description: |
  Detects boot/recovery disabling associated with akira ransomware.
  Incident: dragnet-ransomware-2025-0315
  Associated with Akira.
  Ransomware victim claim by akira: CyberData; country: US; sector: Technology
  First observed: 2025-08-29.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
  - dragnet.actor.akira
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
