title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-6280 — Event Log Clearing (akira)'
id: db0ddf5e-3b9b-5bb5-a26a-31d927022855
status: deprecated
description: |
  Detects event log clearing associated with akira ransomware.
  Incident: dragnet-ransomware-2025-6280
  Associated with Akira.
  Ransomware victim claim by akira: SK group, Za Za Bazaar, TH UK & Ireland Ltd and a few more.; country: GB; sector: Consumer Services
  First observed: 2025-10-27.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
  - dragnet.actor.akira
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
