title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-0534 — Recovery Inhibition (ciphbit)'
id: e512b7fe-ab26-5a79-8097-24328a071e05
status: deprecated
description: |
  Detects boot/recovery disabling associated with ciphbit ransomware.
  Incident: dragnet-ransomware-2025-0534
  Ransomware victim claim by ciphbit: Church of the Ascension Anglican; country: US; sector: Not Found
  First observed: 2025-11-26.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
