title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-2082 — Recovery Inhibition (qilin)'
id: 79b65350-e723-545f-af3c-c01531da243a
status: experimental
description: |
  Detects boot/recovery disabling associated with qilin ransomware.
  Incident: dragnet-ransomware-2025-2082
  Ransomware victim claim by qilin: kontek.com; country: US; sector: Technology
  First observed: 2025-06-18.
  Confidence: 90% (ransomware_live).
references:
  - http://ijzn3sicrcy7guixkzjkib4ukbiilwc3xhnmby4mcbccnsd7j2rekvqd.onion/site/view?uuid=97a9b10e-afb4-3ca8-bbef-02b9a6650f27
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
