title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-5794 — Recovery Inhibition (nova)'
id: 0bbcf744-7409-596f-87d6-f04cb1cd695e
status: experimental
description: |
  Detects boot/recovery disabling associated with nova ransomware.
  Incident: dragnet-ransomware-2025-5794
  Ransomware victim claim by nova: Dansoft; country: US; sector: Technology
  First observed: 2025-07-13.
  Confidence: 90% (ransomware_live).
references:
  - http://leak7y2247fj7dbb35rpfyxuyaqtwbshiwxp6h35ttzlhrxmhvi4fead.onionDansoft
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
