title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0071 — Shadow Copy Deletion (avaddon)'
id: 971b268a-38f8-5b55-be0d-18a342a738b0
status: deprecated
description: |
  Detects shadow copy deletion commands associated with avaddon ransomware.
  Incident: dragnet-ransomware-2021-0071
  Ransomware victim claim by avaddon: Intensive Care On-Line Network , Inc; sector: Healthcare
  First observed: 2021-09-09.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
