title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-1278 — Shadow Copy Deletion (lockbit2)'
id: 82286495-5fc3-5694-8038-86cb0bd7a60b
status: deprecated
description: |
  Detects shadow copy deletion commands associated with lockbit2 ransomware.
  Incident: dragnet-ransomware-2021-1278
  Ransomware victim claim by lockbit2: mpusd.net; sector: Education
  First observed: 2021-11-25.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
