title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0040 — Shadow Copy Deletion (revil)'
id: 7b487c4b-b28d-5984-b35f-55a845a6e155
status: deprecated
description: |
  Detects shadow copy deletion commands associated with revil ransomware.
  Incident: dragnet-ransomware-2021-0040
  Ransomware victim claim by revil: kuk.de / KREBS + KIEFER / 500GB; sector: Manufacturing
  First observed: 2021-09-09.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
