title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0939 — Recovery Inhibition (avaddon)'
id: 4f1764ec-971a-5eca-af23-5fbe0c0dc077
status: deprecated
description: |
  Detects boot/recovery disabling associated with avaddon ransomware.
  Incident: dragnet-ransomware-2021-0939
  Ransomware victim claim by avaddon: Omni Manufacturing, Inc.; sector: Manufacturing
  First observed: 2021-09-09.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
