title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0895 — Shadow Copy Deletion (pysa)'
id: 4113d72a-8bdf-5a94-a26b-aa506e199484
status: deprecated
description: |
  Detects shadow copy deletion commands associated with pysa ransomware.
  Incident: dragnet-ransomware-2021-0895
  Ransomware victim claim by pysa: Jalasoft; sector: Technology
  First observed: 2021-11-08.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
