title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0008 — Event Log Clearing (hive)'
id: dc881830-6613-5031-a7d1-0131fcd5f381
status: deprecated
description: |
  Detects event log clearing associated with hive ransomware.
  Incident: dragnet-ransomware-2021-0008
  Ransomware victim claim by hive: GURTEEN; sector: Not Found
  First observed: 2021-12-18.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
