title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0357 — Shadow Copy Deletion (lockbit2)'
id: f5fe1df4-f336-5892-9f4c-6400f0728d6e
status: deprecated
description: |
  Detects shadow copy deletion commands associated with lockbit2 ransomware.
  Incident: dragnet-ransomware-2021-0357
  Ransomware victim claim by lockbit2: hammer-poznan.p...; sector: Manufacturing
  First observed: 2021-09-09.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
