title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0450 — Shadow Copy Deletion (pysa)'
id: 06f95e5e-446f-5984-865a-44068399d9d1
status: deprecated
description: |
  Detects shadow copy deletion commands associated with pysa ransomware.
  Incident: dragnet-ransomware-2021-0450
  Ransomware victim claim by pysa: Cyclone Steel; sector: Manufacturing
  First observed: 2021-09-09.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
