title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0815 — Shadow Copy Deletion (marketo)'
id: 50bce56c-9de5-5868-97ac-2062dfcb5c99
status: deprecated
description: |
  Detects shadow copy deletion commands associated with marketo ransomware.
  Incident: dragnet-ransomware-2021-0815
  Ransomware victim claim by marketo: Virginia Department of Military Affairs; sector: Public Sector
  First observed: 2021-12-07.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
