title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0855 — Recovery Inhibition (darkleakmarket)'
id: b85df250-ce60-5283-b6ed-eaa238b0f54a
status: deprecated
description: |
  Detects boot/recovery disabling associated with darkleakmarket ransomware.
  Incident: dragnet-ransomware-2021-0855
  Ransomware victim claim by darkleakmarket: ADATA corporation Leak; sector: Technology
  First observed: 2021-09-09.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
