title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-1536 — Event Log Clearing (conti)'
id: 68d51f22-88e4-5c25-98c5-c90f5ee88605
status: deprecated
description: |
  Detects event log clearing associated with conti ransomware.
  Incident: dragnet-ransomware-2021-1536
  Ransomware victim claim by conti: Marans Weisz & Newman, LLC; sector: Business Services
  First observed: 2021-09-22.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
