title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0055 — Recovery Inhibition (pysa)'
id: 43881597-6eee-598f-8780-bdde7276bd69
status: deprecated
description: |
  Detects boot/recovery disabling associated with pysa ransomware.
  Incident: dragnet-ransomware-2021-0055
  Ransomware victim claim by pysa: Weiss Properties; sector: Business Services
  First observed: 2021-10-22.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
