title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0340 — Event Log Clearing (lockbit2)'
id: 0f13370e-4320-5ff8-81c2-d64386becf6e
status: deprecated
description: |
  Detects event log clearing associated with lockbit2 ransomware.
  Incident: dragnet-ransomware-2021-0340
  Ransomware victim claim by lockbit2: meritresources....; sector: Not Found
  First observed: 2021-10-21.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
