title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0430 — Recovery Inhibition (avaddon)'
id: ebeb6ad8-93ad-5d82-8edd-3768703b13c6
status: deprecated
description: |
  Detects boot/recovery disabling associated with avaddon ransomware.
  Incident: dragnet-ransomware-2021-0430
  Ransomware victim claim by avaddon: Cathar Games; sector: Consumer Services
  First observed: 2021-09-09.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
