title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-1484 — Recovery Inhibition (conti)'
id: 5a9f2197-1025-5a1a-853c-a175366b296b
status: deprecated
description: |
  Detects boot/recovery disabling associated with conti ransomware.
  Incident: dragnet-ransomware-2021-1484
  Ransomware victim claim by conti: Pfertner GmbH Immobilienverwaltung; sector: Business Services
  First observed: 2021-10-25.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
