
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2026-0732 — Ransomware C2 Communication'
id: bc9b31e0-64b4-5efc-8957-436c8f978350
status: test
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2026-0732
  Ransomware victim claim by tengu: KSP TLM INDONESIA; country: ID; sector: Financial Services
  First observed: 2026-01-27.
  Confidence: 90% (ransomware_live).
references:
  - http://longcc4fqrfcqt5lzceutylaxir6h66fp6df3oin6mvwvz6pfdbxc6qd.onion/blog/c67e84903e2846c4ee156159fe8d168786be2d7d2c0c624739aaa9ded8bba542/
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://longcc4fqrfcqt5lzceutylaxir6h66fp6df3oin6mvwvz6pfdbxc6qd.onion/blog/c67e84903e2846c4ee156159fe8d168786be2d7d2c0c624739aaa9ded8bba542/'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
