
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2026-3552 — Ransomware C2 Communication'
id: 7f80b721-45f3-5110-972e-4f1e32791308
status: stable
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2026-3552
  Ransomware victim claim by qilin: ROTO Immobilien; country: AT; sector: Construction
  First observed: 2026-05-21.
  Confidence: 90% (ransomware_live).
references:
  - http://ijzn3sicrcy7guixkzjkib4ukbiilwc3xhnmby4mcbccnsd7j2rekvqd.onion/site/blog?uuid=723469f2-6713-46a5-a07c-99f446fd6148
author: dragnet-bot
date: 2026-05-28
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://ijzn3sicrcy7guixkzjkib4ukbiilwc3xhnmby4mcbccnsd7j2rekvqd.onion/site/blog?uuid=723469f2-6713-46a5-a07c-99f446fd6148'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
