
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2023-4884 — Ransomware C2 Communication'
id: 0c7a3da1-b12b-50b0-b286-316ddd66a6d6
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2023-4884
  Ransomware victim claim by lockbit3: retailmerchantservices.co.uk; country: GB; sector: Financial Services
  First observed: 2023-05-29.
  Confidence: 90% (ransomware_live).
references:
  - http://lockbitapt5x4zkjbcqmz6frdhecqqgadevyiwqxukksspnlidyvd7qd.onion/post/N5nzhyPuwEUQyO1h6474a91b713ca
author: dragnet-bot
date: 2026-05-28
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://lockbitapt5x4zkjbcqmz6frdhecqqgadevyiwqxukksspnlidyvd7qd.onion/post/N5nzhyPuwEUQyO1h6474a91b713ca'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
