
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2023-3209 — Ransomware C2 Communication'
id: ce20407a-bd8c-5b8d-afcc-a6d5e5573708
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2023-3209
  Ransomware victim claim by cactus: ghimli.com; country: AU; sector: Consumer Services
  First observed: 2023-08-26.
  Confidence: 90% (ransomware_live).
references:
  - https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/GHIMLI
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/GHIMLI'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
