
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2023-2073 — Ransomware C2 Communication'
id: b22b9f94-9f48-50ab-9f09-0e214366e5bd
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2023-2073
  Ransomware victim claim by cactus: Phoenix Taxis; sector: Transportation/Logistics
  First observed: 2023-07-20.
  Confidence: 90% (ransomware_live).
references:
  - https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/TYNE
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/TYNE'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
