
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2023-4329 — Ransomware C2 Communication'
id: 73596d22-678a-505a-8f80-210611757ee1
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2023-4329
  Ransomware victim claim by blackbasta: SYNQUESTLABS; country: JP; sector: Manufacturing
  First observed: 2023-08-17.
  Confidence: 90% (ransomware_live).
references:
  - http://stniiomyjliimcgkvdszvgen3eaaoz55hreqqx6o77yvmpwt7gklffqd.onion/?id=SYNQUESTLABS
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://stniiomyjliimcgkvdszvgen3eaaoz55hreqqx6o77yvmpwt7gklffqd.onion/?id=SYNQUESTLABS'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
