
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2023-1800 — Ransomware C2 Communication'
id: 45461d9e-68ef-5c77-8b59-16d79557c2a6
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2023-1800
  Ransomware victim claim by noescape: Avertronics Inc; sector: Manufacturing
  First observed: 2023-07-27.
  Confidence: 90% (ransomware_live).
references:
  - http://noescapemsqxvizdxyl7f7rmg5cdjwp33pg2wpmiaaibilb4btwzttad.onion/post/99bf512b-eeb5-4290-8dec-89a38518aaa0
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://noescapemsqxvizdxyl7f7rmg5cdjwp33pg2wpmiaaibilb4btwzttad.onion/post/99bf512b-eeb5-4290-8dec-89a38518aaa0'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
