
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2023-3903 — Ransomware C2 Communication'
id: a2ecd3c1-a8b3-5752-ac26-b62cd1fe5797
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2023-3903
  Ransomware victim claim by lockbit3: sdproducts.co.uk; country: GB; sector: Manufacturing
  First observed: 2023-10-16.
  Confidence: 90% (ransomware_live).
references:
  - http://lockbitapt2d73krlbewgv27tquljgxr33xbwwsp6rkyieto7u4ncead.onion/post/clZZmjvYNbiM3w73652d640451cf7
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://lockbitapt2d73krlbewgv27tquljgxr33xbwwsp6rkyieto7u4ncead.onion/post/clZZmjvYNbiM3w73652d640451cf7'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
