
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2023-1128 — Ransomware C2 Communication'
id: e84cb41a-504c-5e27-ba24-7982594ca0c8
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2023-1128
  Ransomware victim claim by blacksuit: Centroedile Milano; sector: Construction
  First observed: 2023-12-01.
  Confidence: 90% (ransomware_live).
references:
  - http://weg7sdx54bevnvulapqu6bpzwztryeflq3s23tegbmnhkbpqz637f2yd.onion/?id=lTjljU946sms8eIR
author: dragnet-bot
date: 2026-05-28
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://weg7sdx54bevnvulapqu6bpzwztryeflq3s23tegbmnhkbpqz637f2yd.onion/?id=lTjljU946sms8eIR'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
