
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2023-0165 — Ransomware C2 Communication'
id: 47f2023a-2678-541a-9666-58839f0981e9
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2023-0165
  Ransomware victim claim by rhysida: Kauno Technologijos Universitetas; sector: Education
  First observed: 2023-12-19.
  Confidence: 90% (ransomware_live).
references:
  - rhysidafohrhyy2aszi7bm32tnjat5xri65fopcxkdfxhi4tidsg7cad.onion?company=71
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
