
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2023-0774 — Ransomware C2 Communication'
id: a385d531-02a9-5991-9ea2-d6b5ed7f7c0f
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2023-0774
  Ransomware victim claim by clop: SAPIENS.COM; sector: Technology
  First observed: 2023-06-29.
  Confidence: 90% (ransomware_live).
references:
  - http://santat7kpllt6iyvqbr7q4amdv6dzrh6paatvyrzl7ry3zm72zigf4ad.onion/sapiens-com
author: dragnet-bot
date: 2026-05-28
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://santat7kpllt6iyvqbr7q4amdv6dzrh6paatvyrzl7ry3zm72zigf4ad.onion/sapiens-com'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
