title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-5179 — Event Log Clearing (lockbit3)'
id: 57d7ed7c-ca43-59da-994c-d5d6d92b6509
status: deprecated
description: |
  Detects event log clearing associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2023-5179
  Ransomware victim claim by lockbit3: anthonymartin.be; country: BE; sector: Consumer Services
  First observed: 2023-02-19.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
