title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-1228 — Recovery Inhibition (clop)'
id: 3d241535-1d4e-572b-9c56-0254d105fd3b
status: experimental
description: |
  Detects boot/recovery disabling associated with clop ransomware.
  Incident: dragnet-ransomware-2023-1228
  Ransomware victim claim by clop: MORSKATEMANUFACTURING.COM; sector: Manufacturing
  First observed: 2023-11-25.
  Confidence: 90% (ransomware_live).
references:
  - http://santat7kpllt6iyvqbr7q4amdv6dzrh6paatvyrzl7ry3zm72zigf4ad.onion/morskatemanufacturing-com
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
