title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-4295 — Recovery Inhibition (lockbit3)'
id: 34bfcf97-6f9c-57dd-83c7-eb1f8ac8736e
status: experimental
description: |
  Detects boot/recovery disabling associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2023-4295
  Ransomware victim claim by lockbit3: el-cerrito.org; country: US; sector: Public Sector
  First observed: 2023-08-09.
  Confidence: 90% (ransomware_live).
references:
  - http://lockbitapt2d73krlbewgv27tquljgxr33xbwwsp6rkyieto7u4ncead.onion/post/GJZeZFEgjBzyR7X564d386dc3e9e5
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
