title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-0007 — Recovery Inhibition (noescape)'
id: 0021c20d-b357-5980-9851-4e7398ee7bd7
status: experimental
description: |
  Detects boot/recovery disabling associated with noescape ransomware.
  Incident: dragnet-ransomware-2023-0007
  Ransomware victim claim by noescape: Schwob AG; country: CH; sector: Manufacturing
  First observed: 2023-10-25.
  Confidence: 90% (ransomware_live).
references:
  - http://noescapemsqxvizdxyl7f7rmg5cdjwp33pg2wpmiaaibilb4btwzttad.onion/post/9a747913-0173-42f8-af3a-ea4c61b416df
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
