title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-0165 — Event Log Clearing (rhysida)'
id: 187c30a2-9ecc-513b-b7ce-e70454c304e3
status: experimental
description: |
  Detects event log clearing associated with rhysida ransomware.
  Incident: dragnet-ransomware-2023-0165
  Ransomware victim claim by rhysida: Kauno Technologijos Universitetas; sector: Education
  First observed: 2023-12-19.
  Confidence: 90% (ransomware_live).
references:
  - rhysidafohrhyy2aszi7bm32tnjat5xri65fopcxkdfxhi4tidsg7cad.onion?company=71
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
