title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-0165 — Recovery Inhibition (rhysida)'
id: edd7ee18-6409-5a83-ae15-eda8642933f0
status: experimental
description: |
  Detects boot/recovery disabling associated with rhysida ransomware.
  Incident: dragnet-ransomware-2023-0165
  Ransomware victim claim by rhysida: Kauno Technologijos Universitetas; sector: Education
  First observed: 2023-12-19.
  Confidence: 90% (ransomware_live).
references:
  - rhysidafohrhyy2aszi7bm32tnjat5xri65fopcxkdfxhi4tidsg7cad.onion?company=71
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
