title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-0238 — Event Log Clearing (ransomed)'
id: 1f126026-60ad-521d-9243-3d5c5992457f
status: deprecated
description: |
  Detects event log clearing associated with ransomed ransomware.
  Incident: dragnet-ransomware-2023-0238
  Ransomware victim claim by ransomed: Hawaii Health System; sector: Healthcare
  First observed: 2023-09-01.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
