title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-4635 — Event Log Clearing (toufan)'
id: 89fa7b40-368d-50b4-973c-6b02eb2cb858
status: deprecated
description: |
  Detects event log clearing associated with toufan ransomware.
  Incident: dragnet-ransomware-2023-4635
  Ransomware victim claim by toufan: h-o.co.il; country: IL; sector: Business Services
  First observed: 2023-12-19.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
