title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-0495 — Recovery Inhibition (raworld)'
id: cdd35fdf-f41c-588b-8e87-2c6c0e21d745
status: experimental
description: |
  Detects boot/recovery disabling associated with raworld ransomware.
  Incident: dragnet-ransomware-2023-0495
  Ransomware victim claim by raworld: P****X; sector: Not Found
  First observed: 2023-08-04.
  Confidence: 90% (ransomware_live).
references:
  - http://pa32ymaeu62yo5th5mraikgw5fcvznnsiiwti42carjliarodltmqcqd.onion/posts/p/
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
