title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-4249 — Event Log Clearing (hunters)'
id: b47d1c04-a491-5fa8-85c0-cf98cf94f3fb
status: experimental
description: |
  Detects event log clearing associated with hunters ransomware.
  Incident: dragnet-ransomware-2023-4249
  Ransomware victim claim by hunters: InstantWhip; country: US; sector: Not Found
  First observed: 2023-11-27.
  Confidence: 90% (ransomware_live).
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/1443910388
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
