title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-2484 — Shadow Copy Deletion (lockbit3)'
id: 37459cca-f939-561d-b3d1-9e5bf3e3ef1f
status: deprecated
description: |
  Detects shadow copy deletion commands associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2023-2484
  Ransomware victim claim by lockbit3: vissan.com.vn; country: VN; sector: Agriculture and Food Production
  First observed: 2023-02-17.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
