title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-2165 — Shadow Copy Deletion (lockbit3)'
id: 2d74a548-eef0-56f4-9c35-6a012a634d82
status: deprecated
description: |
  Detects shadow copy deletion commands associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2023-2165
  Ransomware victim claim by lockbit3: sagardoy.com; country: ES; sector: Business Services
  First observed: 2023-03-10.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
