title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-4202 — Event Log Clearing (stormous)'
id: 4cff8366-1b58-525b-a795-f27e1e8c0495
status: experimental
description: |
  Detects event log clearing associated with stormous ransomware.
  Incident: dragnet-ransomware-2023-4202
  Ransomware victim claim by stormous: Interep; country: BR; sector: Transportation/Logistics
  First observed: 2023-09-23.
  Confidence: 90% (ransomware_live).
references:
  - http://h3reihqb2y7woqdary2g3bmk3apgtxuyhx4j2ftovbhe3l5svev7bdyd.onion//interep.html
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
