title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-4126 — Shadow Copy Deletion (akira)'
id: 42d1301d-ad28-55cb-8683-311c06eea0cb
status: deprecated
description: |
  Detects shadow copy deletion commands associated with akira ransomware.
  Incident: dragnet-ransomware-2023-4126
  Associated with Akira.
  Ransomware victim claim by akira: Voss Enterprises, Divvies; sector: Consumer Services
  First observed: 2023-08-28.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
  - dragnet.actor.akira
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
