title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-1444 — Shadow Copy Deletion (cuba)'
id: ce853e27-b19d-51f5-9161-33358559d0b2
status: deprecated
description: |
  Detects shadow copy deletion commands associated with cuba ransomware.
  Incident: dragnet-ransomware-2023-1444
  Ransomware victim claim by cuba: portadelaidefc; country: AU; sector: Consumer Services
  First observed: 2023-11-13.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
