title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-5084 — Shadow Copy Deletion (lockbit3)'
id: 4588ec85-7292-59ad-9fe5-d8d2e17bd59b
status: experimental
description: |
  Detects shadow copy deletion commands associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2023-5084
  Ransomware victim claim by lockbit3: tharworx.com; sector: Not Found
  First observed: 2023-03-30.
  Confidence: 90% (ransomware_live).
references:
  - http://lockbitaptbdiajqtplcrigzgdjprwugkkut63nbvy2d5r4w2agyekqd.onion/post/gjZovjwoRd45667u642528e274d23
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
