title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-2661 — Recovery Inhibition (lockbit3)'
id: 1cacb5aa-68ab-5d74-8628-ee8d62ff44ca
status: deprecated
description: |
  Detects boot/recovery disabling associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2023-2661
  Ransomware victim claim by lockbit3: elsan.care; sector: Healthcare
  First observed: 2023-01-24.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
