title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-5048 — Recovery Inhibition (lockbit3)'
id: 2cc20ede-c647-5e33-88cb-7b95bd8bee4b
status: deprecated
description: |
  Detects boot/recovery disabling associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2023-5048
  Ransomware victim claim by lockbit3: cktc.edu; country: US; sector: Education
  First observed: 2023-03-11.
references:
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
