title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-3233 — Shadow Copy Deletion (ragnarlocker)'
id: f3b7df29-6fbf-533f-869d-b53027f5d14e
status: experimental
description: |
  Detects shadow copy deletion commands associated with ragnarlocker ransomware.
  Incident: dragnet-ransomware-2023-3233
  Ransomware victim claim by ragnarlocker: Announcement: Stratesys solutions going to be leaked; sector: Not Found
  First observed: 2023-09-21.
  Confidence: 90% (ransomware_live).
references:
  - http://rgleaktxuey67yrgspmhvtnrqtgogur35lwdrup4d3igtbm3pupc4lyd.onion/?4mmkFjO3nDU
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
