title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-0196 — Recovery Inhibition (dragonforce)'
id: df2df272-4a2e-51d4-a103-39795baf7d59
status: stable
description: |
  Detects boot/recovery disabling associated with dragonforce ransomware.
  Incident: dragnet-ransomware-2026-0196
  Ransomware victim claim by dragonforce: Fountain; country: BE; sector: Consumer Services
  First observed: 2026-04-01.
  Confidence: 90% (ransomware_live).
references:
  - http://z3wqggtxft7id3ibr7srivv5gjof5fwg76slewnzwwakjuf3nlhukdid.onion/blog/?post_uuid=3ee4bbb2-0ac1-4a17-ac6e-4fcfbb332aff
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
