title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-1650 — Event Log Clearing (thegentlemen)'
id: 0a66e397-1a19-59d5-9d77-a53f37987023
status: deprecated
description: |
  Detects event log clearing associated with thegentlemen ransomware.
  Incident: dragnet-ransomware-2026-1650
  Ransomware victim claim by thegentlemen: Internal Medicine; country: US; sector: Healthcare
  First observed: 2026-05-18.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
