title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-3174 — Event Log Clearing (cmdorganization)'
id: 6b6357a3-0401-5026-b87c-d7c21464c7cd
status: deprecated
description: |
  Detects event log clearing associated with cmdorganization ransomware.
  Incident: dragnet-ransomware-2026-3174
  Ransomware victim claim by cmdorganization: Holy Name of Jesus; country: US; sector: Not Found
  First observed: 2026-05-17.
references:
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
