title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-0594 — Shadow Copy Deletion (brotherhood)'
id: b42c3c68-4dcf-5095-83de-66e414465beb
status: deprecated
description: |
  Detects shadow copy deletion commands associated with brotherhood ransomware.
  Incident: dragnet-ransomware-2026-0594
  Ransomware victim claim by brotherhood: Italgrafica Sistemi; country: IT; sector: Manufacturing
  First observed: 2026-01-06.
references:
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
