
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-1987 — Ransomware C2 Communication'
id: 271b8e04-f0e8-507e-aa48-72186deb0833
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-1987
  Ransomware victim claim by alphv: Worthen Industries [FULL DATA]; country: US; sector: Manufacturing
  First observed: 2024-02-24.
  Confidence: 90% (ransomware_live).
references:
  - http://alphvuzxyxv6ylumd2ngp46xzq3pw6zflomrghvxeuks6kklberrbmyd.onion/bf513970-73e4-4314-9082-9cfa2ce55eee
author: dragnet-bot
date: 2026-05-28
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://alphvuzxyxv6ylumd2ngp46xzq3pw6zflomrghvxeuks6kklberrbmyd.onion/bf513970-73e4-4314-9082-9cfa2ce55eee'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
