
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-1045 — Ransomware C2 Communication'
id: 29c2ecbb-22a4-5a45-9e0c-090961eafe32
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-1045
  Ransomware victim claim by blackbasta: doyon.com | doyondrilling.com; country: US; sector: Energy
  First observed: 2024-04-02.
  Confidence: 90% (ransomware_live).
references:
  - http://stniiomyjliimcgkvdszvgen3eaaoz55hreqqx6o77yvmpwt7gklffqd.onion/?id=doyon.com%20|%20doyondrilling.com
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://stniiomyjliimcgkvdszvgen3eaaoz55hreqqx6o77yvmpwt7gklffqd.onion/?id=doyon.com%20|%20doyondrilling.com'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
