
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-0954 — Ransomware C2 Communication'
id: 94c26878-d214-5890-a95c-e0ebb4157451
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-0954
  Ransomware victim claim by blackbasta: duvel.com | boulevard.com; country: BE; sector: Agriculture and Food Production
  First observed: 2024-03-12.
  Confidence: 90% (ransomware_live).
references:
  - http://stniiomyjliimcgkvdszvgen3eaaoz55hreqqx6o77yvmpwt7gklffqd.onion/?id=duvel.com%20|%20boulevard.com
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://stniiomyjliimcgkvdszvgen3eaaoz55hreqqx6o77yvmpwt7gklffqd.onion/?id=duvel.com%20|%20boulevard.com'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
