
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-2966 — Ransomware C2 Communication'
id: 85a674f9-f12a-5939-bf86-69a0fa731dba
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-2966
  Ransomware victim claim by cactus: fulcrum.pro; country: US; sector: Technology
  First observed: 2024-04-10.
  Confidence: 90% (ransomware_live).
references:
  - https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/FULCRUMGROUP
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/FULCRUMGROUP'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
