
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-2905 — Ransomware C2 Communication'
id: 532b4326-2e9e-58b7-9e98-dc13064d8d18
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-2905
  Ransomware victim claim by hunters: Satse; country: ES; sector: Healthcare
  First observed: 2024-02-13.
  Confidence: 90% (ransomware_live).
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/9165557267
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/9165557267'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
