
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-2216 — Ransomware C2 Communication'
id: de9337de-d2aa-5760-9e23-eec04c416612
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-2216
  Ransomware victim claim by babuk2: alliedwoundcare.com; country: US; sector: Healthcare
  First observed: 2024-01-12.
  Confidence: 90% (ransomware_live).
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/a06f31ad9c65f1d557b569ba10a10a5295c17c59d9235003cca88a78ffa894c0/
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
