
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-1871 — Ransomware C2 Communication'
id: edf4b7cf-1e50-5af7-a71f-368b3e6270bc
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-1871
  Ransomware victim claim by hunters: Banco Sucredito Regional S.A.U.; country: AR; sector: Financial Services
  First observed: 2024-10-25.
  Confidence: 90% (ransomware_live).
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/5680848383
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/5680848383'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
