
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-5454 — Ransomware C2 Communication'
id: 6d83050e-4aa3-5bdf-9113-3e3a5af6fa62
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-5454
  Ransomware victim claim by hunters: Rocky Mountain Sales; country: US; sector: Not Found
  First observed: 2024-04-26.
  Confidence: 90% (ransomware_live).
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/8971272378
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/8971272378'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
