
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-0773 — Ransomware C2 Communication'
id: 5a043d50-df03-5167-8659-bdb9b52d6697
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-0773
  Ransomware victim claim by cactus: newagesys.com; country: US; sector: Technology
  First observed: 2024-02-29.
  Confidence: 90% (ransomware_live).
references:
  - https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/NEWAGESYS
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/NEWAGESYS'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
