
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-1342 — Ransomware C2 Communication'
id: b5a80456-6383-5fd5-9b03-226987d7ca49
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-1342
  Ransomware victim claim by hunters: Thermosash Commercial Ltd; country: NZ; sector: Business Services
  First observed: 2024-01-04.
  Confidence: 90% (ransomware_live).
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/1181368234
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/1181368234'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
