
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-5349 — Ransomware C2 Communication'
id: d04a01bb-8a72-580b-8cc9-e89febd800f5
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-5349
  Ransomware victim claim by cactus: transportlaberge.com; country: CA; sector: Transportation/Logistics
  First observed: 2024-05-22.
  Confidence: 90% (ransomware_live).
references:
  - https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/TRANSLAB
author: dragnet-bot
date: 2026-05-28
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/TRANSLAB'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
