
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-4293 — Ransomware C2 Communication'
id: f2e3cf19-96c4-54a4-abdc-eab5b078d074
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-4293
  Ransomware victim claim by hunters: Santa Rosa; country: AR; sector: Public Sector
  First observed: 2024-07-18.
  Confidence: 90% (ransomware_live).
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/4458882301
author: dragnet-bot
date: 2026-05-28
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/4458882301'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
