
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-3725 — Ransomware C2 Communication'
id: 0c14209b-be09-59be-86d0-0b24b90049fd
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-3725
  Associated with Akira.
  Ransomware victim claim by akira: PJ's Rebar; country: US; sector: Manufacturing
  First observed: 2024-12-28.
  Confidence: 90% (ransomware_live).
references:
  - unionstudioarch.com
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
  - dragnet.actor.akira
logsource:
  category: network_connection
  product: any
detection:
  condition: selection
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
