
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-2505 — Ransomware C2 Communication'
id: 7bba7ec6-1b03-5456-a782-0a690036a29c
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-2505
  Ransomware victim claim by ransomhub: troxlerlabs.com; country: US; sector: Manufacturing
  First observed: 2024-12-04.
  Confidence: 90% (ransomware_live).
references:
  - http://ransomxifxwc5eteopdobynonjctkxxvap77yqifu2emfbecgbqdw6qd.onion/fa1e00ed-ce5e-487e-8b48-55b5e7916bae/
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://ransomxifxwc5eteopdobynonjctkxxvap77yqifu2emfbecgbqdw6qd.onion/fa1e00ed-ce5e-487e-8b48-55b5e7916bae/'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
