
title: 'Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-3024 — Ransomware C2 Communication'
id: edb799da-1e18-542e-a489-84aad18502d0
status: experimental
description: |
  Detects network connections to known ransomware operator infrastructure.
  Incident: dragnet-ransomware-2024-3024
  Ransomware victim claim by medusa: Broker Educational Sales & Training; country: US; sector: Education
  First observed: 2024-12-19.
  Confidence: 90% (ransomware_live).
references:
  - http://cx5u7zxbvrfyoj6ughw76oa264ucuuizmmzypwum6ear7pct4yc723qd.onion/detail?id=64ec98e222b44511a340cef74ba6445f
author: dragnet-bot
date: 2026-05-20
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.ransomware
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'http://cx5u7zxbvrfyoj6ughw76oa264ucuuizmmzypwum6ear7pct4yc723qd.onion/detail?id=64ec98e222b44511a340cef74ba6445f'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
