
title: 'Dragnet [IOC]: dragnet-supply-2026-21866 — C2 Network Communication'
id: f42008bc-b3d5-5c91-9940-1743ff9763b0
status: test
description: |
  Detects network connections to known C2 infrastructure associated with a supply chain incident.
  Incident: dragnet-supply-2026-21866
  cryptography NULL pointer dereference with pkcs12.serialize_key_and_certificates when called with a non-matching certificate and private key and an hmac_hash override
  Confidence: 80% (stepsecurity).
references:
  - https://nvd.nist.gov/vuln/detail/CVE-2023-50782
  - https://nvd.nist.gov/vuln/detail/CVE-2024-26130
  - https://nvd.nist.gov/vuln/detail/CVE-2024-12797
  - https://nvd.nist.gov/vuln/detail/CVE-2024-0727
  - https://nvd.nist.gov/vuln/detail/CVE-2023-38325
  - https://nvd.nist.gov/vuln/detail/CVE-2018-10903
  - https://nvd.nist.gov/vuln/detail/CVE-2020-25659
  - https://nvd.nist.gov/vuln/detail/CVE-2023-49083
  - https://nvd.nist.gov/vuln/detail/CVE-2026-34073
  - https://nvd.nist.gov/vuln/detail/CVE-2026-39892
  - https://nvd.nist.gov/vuln/detail/CVE-2016-9243
  - https://nvd.nist.gov/vuln/detail/CVE-2026-26007
  - https://nvd.nist.gov/vuln/detail/CVE-2020-36242
  - https://nvd.nist.gov/vuln/detail/CVE-2023-23931
  - https://nvd.nist.gov/vuln/detail/CVE-2023-0286
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.supply-chain
logsource:
  category: network_connection
  product: any
detection:
  selection_ip:
    DestinationIp|contains:
      - '160.119.64.3'
  condition: selection_ip
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
