title: 'Dragnet [IOC]: dragnet-supply-2026-234771 — Malicious File Hash'
id: b4155852-36de-5500-b078-15840d345bd8
status: stable
description: |
  Detects known-malicious file hashes associated with compromised package artifacts.
  Incident: dragnet-supply-2026-234771
  First observed: 2026-05-19.
  Confidence: 90% (wiz).
references:
  - https://www.wiz.io/blog/durabletask-teampcp-supply-chain-attack
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1195.002
logsource:
  category: file_event
  product: any
detection:
  selection:
    Hashes|contains:
      - 'SHA256=069ac1dc7f7649b76bc72a11ac700f373804bfd81dab7e561157b703999f44ce'
      - 'SHA256=7d80b3ef74ad7992b93c31966962612e4e2ceb93e7727cdbd1d2a9af47d44ba8'
      - 'SHA256=aeaf583e20347bf850e2fabdcd6f4982996ba023f8c2cd56bbd299cfd56516f5'
      - 'SHA256=877ff2531a63393c4cb9c3c86908b62d9c4fc3db971bc231c48537faae6cb3ec'
  condition: selection
falsepositives:
  - None expected — these are exact cryptographic hashes
level: medium
