
title: 'Dragnet [IOC]: dragnet-supply-2026-21866 — C2 Network Communication'
id: f42008bc-b3d5-5c91-9940-1743ff9763b0
status: test
description: |
  Detects network connections to known C2 infrastructure associated with a supply chain incident.
  Incident: dragnet-supply-2026-21866
  cryptography NULL pointer dereference with pkcs12.serialize_key_and_certificates when called with a non-matching certificate and private key and an hmac_hash override
  Confidence: 80% (stepsecurity).
references:
  - https://nvd.nist.gov/vuln/detail/CVE-2023-50782
  - https://nvd.nist.gov/vuln/detail/CVE-2024-26130
  - https://nvd.nist.gov/vuln/detail/CVE-2024-12797
  - https://github.com/pyca/cryptography/security/advisories/GHSA-39hc-v87j-747x
  - https://github.com/pyca/cryptography/commit/382e759bcded5773330eeed748c86b213ec618c5
  - https://github.com/pyca/cryptography/commit/cf2ada625d1188d6cd46396f301b98095da577f7
  - https://github.com/pyca/cryptography
  - https://github.com/pyca/cryptography/issues/9785
  - https://github.com/pyca/cryptography/security/advisories/GHSA-5cpq-8wj7-hf2v
  - https://github.com/pyca/cryptography/commit/8708245ccdeaff21d65eea68a4f8d2a7c5949a22
  - https://github.com/pyca/cryptography/security/advisories/GHSA-6vqw-3v5j-54x4
  - https://github.com/pyca/cryptography/pull/10423
  - https://github.com/pyca/cryptography/commit/97d231672763cdb5959a3b191e692a362f1b9e55
  - https://github.com/pypa/advisory-database/tree/main/vulns/cryptography/PYSEC-2024-225.yaml
  - https://github.com/pyca/cryptography/security/advisories/GHSA-79v4-65xg-pq4g
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
  - dragnet.supply-chain
logsource:
  category: network_connection
  product: any
detection:
  selection_ip:
    DestinationIp|contains:
      - '160.119.64.3'
  condition: selection_ip
falsepositives:
  - Legitimate traffic to shared infrastructure
level: high
