
title: 'Dragnet [IOC]: dragnet-supply-2026-97773 — C2 Network Communication'
id: 60638311-478f-532f-b2b8-16a08f7ac6e4
status: stable
description: |
  Detects network connections to known C2 infrastructure associated with a supply chain incident.
  Incident: dragnet-supply-2026-97773
  First observed: 2026-03-31.
  Confidence: 90% (wiz).
references:
  - https://www.wiz.io/blog/axios-npm-compromised-in-supply-chain-attack
author: dragnet-bot
date: 2026-05-22
tags:
  - attack.t1071.001
  - attack.t1041
logsource:
  category: network_connection
  product: any
detection:
  selection_domain:
    DestinationHostname|contains:
      - '07d889e2dadce6f3910dcbc253317d28ca61c766Domainsfrclak.comC2'
      - 'domain-Domaincallnrwise.comC2'
      - '-IP142.11.206.73C2'
      - 'proton.meThreat'
  condition: selection_domain
falsepositives:
  - Legitimate traffic to shared infrastructure
level: medium
