title: 'Dragnet [IOC]: dragnet-supply-2026-122634 — Malicious File Hash'
id: 45c6c9ac-07da-5605-a2ee-48b0d12fce79
status: test
description: |
  Detects known-malicious file hashes associated with compromised package artifacts.
  Incident: dragnet-supply-2026-122634
  First observed: 2026-04-02.
  Confidence: 80% (stepsecurity).
references:
  - https://www.stepsecurity.io/blog/malicious-iolitelabs-vscode-extensions-target-solidity-developers-on-windows-macos-and-linux-with-backdoor
author: dragnet-bot
date: 2026-05-19
tags:
  - attack.t1195.002
logsource:
  category: file_event
  product: any
detection:
  selection:
    Hashes|contains:
      - 'SHA256=e0f206aac2c3fa733b0c466d2ebb86ba038cf1fe2edeee21e94a4d943a27f63b'
      - 'SHA256=fcd398abc51fd16e8bc93ef8d88a23d7dec28081b6dfce4b933020322a610508'
      - 'SHA256=e7ec4e35d94d01a2e4ee5dca62b8fb08ac7411596edb54b398651f4eb563561d'
  condition: selection
falsepositives:
  - None expected — these are exact cryptographic hashes
level: medium
